---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.TextTypeId
source: html/2dafa119-388e-754c-bd42-ac3635beeac5.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.TextTypeId Property

Element id of text associated with the settings.

## Syntax (C#)
```csharp
public ElementId TextTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null